# DivisionContainsNoParts Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..DivisionContainsNoParts Property
BuiltInFailures..::..DPartFailures Class See Also
---
The division contains no parts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DivisionContainsNoParts { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivisionContainsNoParts As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DivisionContainsNoParts {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace